АлогистикТест2/src/Documents/алк_ПередачаНаОтветхранение/алк_ПередачаНаОтветхранение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПередачаНаОтветхранение</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <basedOn>Document.алк_ПеремещениеЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПеремещениеЛесопродукции</types>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатПроизводителя</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПередачаНаОтветхранение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда  			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
		Иначе			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПриемкаЛесопродукции")] = "ЗаполнитьПоПриемкаЛесопродукции";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПеремещениеЛесопродукции")] = "ЗаполнитьПоПеремещениеЛесопродукции";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
		КонецЕсли; 	
					
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			
			ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
			
			Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
			
		КонецЕсли; 
		
		
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ДокументОснование) Тогда
			
			РезультатПроверки = ПроверитьОснованиеНаДубли();
			
			Если РезультатПроверки <> Неопределено Тогда
				
				Отказ = Истина;
				
				Дубли = "";
				Для каждого стрРезультат Из РезультатПроверки Цикл
					Дубли = Дубли + ?(Дубли <> "", ", ", "") + стрРезультат.Ссылка;	
				КонецЦикла; 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Дублируются документы в разрезе приемки (основанию)! " + Дубли;
				Сообщение.Сообщить(); 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Если Не Отказ Тогда	
				// Инициализация дополнительных свойств для проведения документа
				УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);				
				Документы.алк_ПередачаНаОтветхранение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

				
				Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведенияДокумента.Оперативный, ДополнительныеСвойства, "алк_УчетЛесопродукцииНаОтветхранении_ОтменаПроведения");		
			КонецЕсли;   		
		КонецЕсли;  	
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_ПередачаНаОтветхранение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьУчетЛесопродукцииНаОтветхранении(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
		
		//Сергеева Г.О. ++
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. --
		
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);

		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
		
		Если Не ОтказПоКонтролю Тогда		
			ОтказПоКонтролю	= РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведенияДокумента.Оперативный, ДополнительныеСвойства, "алк_УчетЛесопродукцииНаОтветхранении");		
		КонецЕсли;
		
			
		Если ОтказПоКонтролю И Не ПропускатьМинус Тогда  			
			Отказ = Истина;                          			
		КонецЕсли;
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	#КонецОбласти	
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		//Если ДанныеЗаполнения.Свойство("Основание") Тогда
		//	
		//КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
	КонецПроцедуры
	
	// Обработчик заполнения документа на основании "Приемка лесопродукции".
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоПриемкаЛесопродукции(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование       = ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.Производитель           = ДанныеЗаполнения.Производитель;
		ЭтотОбъект.Организация             = ДанныеЗаполнения.Организация;
		ЭтотОбъект.Сертификат              = ДанныеЗаполнения.Сертификат;
		ЭтотОбъект.СертификатПроизводителя = ДанныеЗаполнения.СертификатПроизводителя;
		ЭтотОбъект.НомерВагона             = ДанныеЗаполнения.НомерВагона;
		ЭтотОбъект.НомерНакладной          = ДанныеЗаполнения.НомерНакладной;
		
		Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.ПиловочникГОСТ Цикл
			
			Если ТекСтрокаЗапасы.Основная ИЛИ Не ТекСтрокаЗапасы.Штабель.Несоответствие Тогда
				Продолжить;	
			КонецЕсли; 
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапасы);
			
		КонецЦикла;
		
	КонецПроцедуры
	
	// Обработчик заполнения документа на основании "Приемка лесопродукции".
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоПеремещениеЛесопродукции(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование       = ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.Организация             = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
			
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапасы);
			Если ТипЗнч(ДанныеЗаполнения.ЯчейкаПолучатель) = Тип("СправочникСсылка.алк_Штабели")  Тогда
				НоваяСтрока.Штабель = ДанныеЗаполнения.ЯчейкаПолучатель;		
			КонецЕсли;	
			
			ЭтотОбъект.Сертификат              = ТекСтрокаЗапасы.Сертификат;
			ЭтотОбъект.СертификатПроизводителя = ТекСтрокаЗапасы.Сертификат;
			
		КонецЦикла;
		
	КонецПроцедуры

	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьЗапасыПоТЧДокументыОснования();
		
	КонецПроцедуры
	
	Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
		
		Запасы.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ПриемкаЛесопродукции") Тогда
			
			ЗаполнитьПоПриемкаЛесопродукции(ДокументОснование);
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ПеремещениеЛесопродукции") Тогда
			
			ЗаполнитьПоПеремещениеЛесопродукции(ДокументОснование);		
			
		КонецЕсли
		
		
	КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	#КонецОбласти
	
	
	#Область СлужебныеПиФ
	
	Функция ПроверитьОснованиеНаДубли()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПередачаНаОтветхранение.Ссылка
		|ИЗ
		|	Документ.алк_ПередачаНаОтветхранение КАК алк_ПередачаНаОтветхранение
		|ГДЕ
		|	алк_ПередачаНаОтветхранение.Проведен
		|	И алк_ПередачаНаОтветхранение.Ссылка <> &Ссылка
		|	И алк_ПередачаНаОтветхранение.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Возврат РезультатЗапроса.Выгрузить();
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли; 
		
	КонецФункции // ПроверитьПартиюНаДубли()
	
	#КонецОбласти 
	
#КонецЕсли

Процедура Конец()
КонецПроцедуры
